# Даны катеты прямоугольного треугольника. Найти его гипотенузу и площадь

a = 4
b = 3

c = (a**2 + b**2) ** 0.5
s = a * b * 0.5

# print(c)
print("Длина гипотенузы:", int(c))  # так как нет условий в постановке, отобразил для пользователя в int
# print(s)
print("Площадь прямоугольного треугольника:", int(s))  # отобразил для пользователя в int
