# Даны числа x и y. Получить x − y / 5 + xy

x = 10
y = 5

print(x - y / 5 + x * y)
print(int(x - y / 5 + x * y)) # так как нет условий в постановке, вывел дополнительно в int
